hadess/rtl8723bs/hal/hal_com_phycfg.c
		case rTxAGC_A_Mcs03_Mcs00:
		case rTxAGC_B_Mcs03_Mcs00:
			RateIndex[0] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS0 );
			RateIndex[1] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS1 );
			RateIndex[2] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS2 );
			RateIndex[3] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS3 );
			for ( i = 0; i < 4; ++ i )
			{
				PwrByRateVal[i] = ( s8 ) ( ( ( ( Value >> (i * 8 + 4) ) & 0xF ) ) * 10 + 
												( ( Value >> (i * 8) ) & 0xF ) );
			}
			*RateNum = 4;
			break;
			
		case rTxAGC_A_Mcs07_Mcs04:
		case rTxAGC_B_Mcs07_Mcs04:
			RateIndex[0] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS4 );
			RateIndex[1] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS5 );
			RateIndex[2] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS6 );
			RateIndex[3] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS7 );
			for ( i = 0; i < 4; ++ i )
			{
				PwrByRateVal[i] = ( s8 ) ( ( ( ( Value >> (i * 8 + 4) ) & 0xF ) ) * 10 + 
												( ( Value >> (i * 8) ) & 0xF ) );
			}
			*RateNum = 4;
			break;
			
		case rTxAGC_A_Mcs11_Mcs08:
		case rTxAGC_B_Mcs11_Mcs08:
			RateIndex[0] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS8 );
			RateIndex[1] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS9 );
			RateIndex[2] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS10 );
			RateIndex[3] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS11 );
			for ( i = 0; i < 4; ++ i )
			{
				PwrByRateVal[i] = ( s8 ) ( ( ( ( Value >> (i * 8 + 4) ) & 0xF ) ) * 10 + 
												( ( Value >> (i * 8) ) & 0xF ) );
			}
			*RateNum = 4;
			break;
			
		case rTxAGC_A_Mcs15_Mcs12:
		case rTxAGC_B_Mcs15_Mcs12:
			RateIndex[0] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS12 );
			RateIndex[1] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS13 );
			RateIndex[2] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS14 );
			RateIndex[3] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS15 );
			for ( i = 0; i < 4; ++ i )
			{
				PwrByRateVal[i] = ( s8 ) ( ( ( ( Value >> (i * 8 + 4) ) & 0xF ) ) * 10 + 
												( ( Value >> (i * 8) ) & 0xF ) );
			}
			*RateNum = 4;
			
			break;
			
		case rTxAGC_B_CCK1_55_Mcs32:
			RateIndex[0] = PHY_GetRateIndexOfTxPowerByRate( MGN_1M );
			RateIndex[1] = PHY_GetRateIndexOfTxPowerByRate( MGN_2M );
			RateIndex[2] = PHY_GetRateIndexOfTxPowerByRate( MGN_5_5M );
			for ( i = 1; i < 4; ++ i )
			{
				PwrByRateVal[i - 1] = ( s8 ) ( ( ( ( Value >> ( i * 8 + 4) ) & 0xF ) ) * 10 + 
												( ( Value >> ( i * 8) ) & 0xF ) );
			}
			*RateNum = 3;
			break;
			
		case 0xC20:
		case 0xE20:
		case 0x1820:
		case 0x1a20:
			RateIndex[0] = PHY_GetRateIndexOfTxPowerByRate( MGN_1M );
			RateIndex[1] = PHY_GetRateIndexOfTxPowerByRate( MGN_2M );
			RateIndex[2] = PHY_GetRateIndexOfTxPowerByRate( MGN_5_5M );
			RateIndex[3] = PHY_GetRateIndexOfTxPowerByRate( MGN_11M );
			for ( i = 0; i < 4; ++ i )
			{
				PwrByRateVal[i] = ( s8 ) ( ( ( ( Value >> (i * 8 + 4) ) & 0xF ) ) * 10 + 
												( ( Value >> (i * 8) ) & 0xF ) );
			}
			*RateNum = 4;
			break;
			
		case 0xC24:
		case 0xE24:
		case 0x1824:
		case 0x1a24:
			RateIndex[0] = PHY_GetRateIndexOfTxPowerByRate( MGN_6M );
			RateIndex[1] = PHY_GetRateIndexOfTxPowerByRate( MGN_9M );
			RateIndex[2] = PHY_GetRateIndexOfTxPowerByRate( MGN_12M );
			RateIndex[3] = PHY_GetRateIndexOfTxPowerByRate( MGN_18M );
			for ( i = 0; i < 4; ++ i )
			{
				PwrByRateVal[i] = ( s8 ) ( ( ( ( Value >> (i * 8 + 4) ) & 0xF ) ) * 10 + 
												( ( Value >> (i * 8) ) & 0xF ) );
			}
			*RateNum = 4;
			break;

		case 0xC28:
		case 0xE28:
		case 0x1828:
		case 0x1a28:
			RateIndex[0] = PHY_GetRateIndexOfTxPowerByRate( MGN_24M );
			RateIndex[1] = PHY_GetRateIndexOfTxPowerByRate( MGN_36M );
			RateIndex[2] = PHY_GetRateIndexOfTxPowerByRate( MGN_48M );
			RateIndex[3] = PHY_GetRateIndexOfTxPowerByRate( MGN_54M );
			for ( i = 0; i < 4; ++ i )
			{
				PwrByRateVal[i] = ( s8 ) ( ( ( ( Value >> (i * 8 + 4) ) & 0xF ) ) * 10 + 
												( ( Value >> (i * 8) ) & 0xF ) );
			}
			*RateNum = 4;
			break;

		case 0xC2C:
		case 0xE2C:
		case 0x182C:
		case 0x1a2C:
			RateIndex[0] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS0 );
			RateIndex[1] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS1 );
			RateIndex[2] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS2 );
			RateIndex[3] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS3 );
			for ( i = 0; i < 4; ++ i )
			{
				PwrByRateVal[i] = ( s8 ) ( ( ( ( Value >> (i * 8 + 4) ) & 0xF ) ) * 10 + 
												( ( Value >> (i * 8) ) & 0xF ) );
			}
			*RateNum = 4;
			break;

		case 0xC30:
		case 0xE30:
		case 0x1830:
		case 0x1a30:
			RateIndex[0] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS4 );
			RateIndex[1] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS5 );
			RateIndex[2] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS6 );
			RateIndex[3] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS7 );
			for ( i = 0; i < 4; ++ i )
			{
				PwrByRateVal[i] = ( s8 ) ( ( ( ( Value >> (i * 8 + 4) ) & 0xF ) ) * 10 + 
												( ( Value >> (i * 8) ) & 0xF ) );
			}
			*RateNum = 4;
			break;

		case 0xC34:
		case 0xE34:
		case 0x1834:
		case 0x1a34:
			RateIndex[0] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS8 );
			RateIndex[1] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS9 );
			RateIndex[2] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS10 );
			RateIndex[3] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS11 );
			for ( i = 0; i < 4; ++ i )
			{
				PwrByRateVal[i] = ( s8 ) ( ( ( ( Value >> (i * 8 + 4) ) & 0xF ) ) * 10 + 
												( ( Value >> (i * 8) ) & 0xF ) );
			}
			*RateNum = 4;
			break;

		case 0xC38:
		case 0xE38:
		case 0x1838:
		case 0x1a38:
			RateIndex[0] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS12 );
			RateIndex[1] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS13 );
			RateIndex[2] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS14 );
			RateIndex[3] = PHY_GetRateIndexOfTxPowerByRate( MGN_MCS15 );
			for ( i = 0; i < 4; ++ i )
			{
				PwrByRateVal[i] = ( s8 ) ( ( ( ( Value >> (i * 8 + 4) ) & 0xF ) ) * 10 + 
												( ( Value >> (i * 8) ) & 0xF ) );
			}
			*RateNum = 4;
			break;

		case 0xC3C:
		case 0xE3C:
		case 0x183C:
		case 0x1a3C:
			RateIndex[0] = PHY_GetRateIndexOfTxPowerByRate( MGN_VHT1SS_MCS0 );
			RateIndex[1] = PHY_GetRateIndexOfTxPowerByRate( MGN_VHT1SS_MCS1 );
			RateIndex[2] = PHY_GetRateIndexOfTxPowerByRate( MGN_VHT1SS_MCS2 );
			RateIndex[3] = PHY_GetRateIndexOfTxPowerByRate( MGN_VHT1SS_MCS3 );
			for ( i = 0; i < 4; ++ i )
			{
				PwrByRateVal[i] = ( s8 ) ( ( ( ( Value >> (i * 8 + 4) ) & 0xF ) ) * 10 + 
												( ( Value >> (i * 8) ) & 0xF ) );
			}
			*RateNum = 4;
			break;

		case 0xC40:
		case 0xE40:
		case 0x1840:
		case 0x1a40:
			RateIndex[0] = PHY_GetRateIndexOfTxPowerByRate( MGN_VHT1SS_MCS4 );
			RateIndex[1] = PHY_GetRateIndexOfTxPowerByRate( MGN_VHT1SS_MCS5 );
			RateIndex[2] = PHY_GetRateIndexOfTxPowerByRate( MGN_VHT1SS_MCS6 );
			RateIndex[3] = PHY_GetRateIndexOfTxPowerByRate( MGN_VHT1SS_MCS7 );
			for ( i = 0; i < 4; ++ i )
			{
				PwrByRateVal[i] = ( s8 ) ( ( ( ( Value >> (i * 8 + 4) ) & 0xF ) ) * 10 + 
												( ( Value >> (i * 8) ) & 0xF ) );
			}
			*RateNum = 4;
			break;

		case 0xC44:
		case 0xE44:
		case 0x1844:
		case 0x1a44:
			RateIndex[0] = PHY_GetRateIndexOfTxPowerByRate( MGN_VHT1SS_MCS8 );
			RateIndex[1] = PHY_GetRateIndexOfTxPowerByRate( MGN_VHT1SS_MCS9 );
			RateIndex[2] = PHY_GetRateIndexOfTxPowerByRate( MGN_VHT2SS_MCS0 );
			RateIndex[3] = PHY_GetRateIndexOfTxPowerByRate( MGN_VHT2SS_MCS1 );
			for ( i = 0; i < 4; ++ i )
			{
				PwrByRateVal[i] = ( s8 ) ( ( ( ( Value >> (i * 8 + 4) ) & 0xF ) ) * 10 + 
												( ( Value >> (i * 8) ) & 0xF ) );
			}
			*RateNum = 4;
			break;

		case 0xC48:
		case 0xE48:
		case 0x1848:
		case 0x1a48:
			RateIndex[0] = PHY_GetRateIndexOfTxPowerByRate( MGN_VHT2SS_MCS2 );
			RateIndex[1] = PHY_GetRateIndexOfTxPowerByRate( MGN_VHT2SS_MCS3 );
			RateIndex[2] = PHY_GetRateIndexOfTxPowerByRate( MGN_VHT2SS_MCS4 );
			RateIndex[3] = PHY_GetRateIndexOfTxPowerByRate( MGN_VHT2SS_MCS5 );
			for ( i = 0; i < 4; ++ i )
			{
				PwrByRateVal[i] = ( s8 ) ( ( ( ( Value >> (i * 8 + 4) ) & 0xF ) ) * 10 + 
												( ( Value >> (i * 8) ) & 0xF ) );
			}
			*RateNum = 4;
			break;

