hadess/rtl8723bs/hal/hal_com_phycfg.c
	//DBG_871X("=====> PHY_InitTxPowerLimit()!\n" );

	for ( i = 0; i < MAX_REGULATION_NUM; ++i )
	{
		for ( j = 0; j < MAX_2_4G_BANDWITH_NUM; ++j )
			for ( k = 0; k < MAX_RATE_SECTION_NUM; ++k )
				for ( m = 0; m < CHANNEL_MAX_NUMBER_2G; ++m )
					for ( l = 0; l < MAX_RF_PATH_NUM; ++l )
						pHalData->TxPwrLimit_2_4G[i][j][k][m][l] = MAX_POWER_INDEX;
	}

	for ( i = 0; i < MAX_REGULATION_NUM; ++i )
	{
		for ( j = 0; j < MAX_5G_BANDWITH_NUM; ++j )
			for ( k = 0; k < MAX_RATE_SECTION_NUM; ++k )
				for ( m = 0; m < CHANNEL_MAX_NUMBER_5G; ++m )
					for ( l = 0; l < MAX_RF_PATH_NUM; ++l )
						pHalData->TxPwrLimit_5G[i][j][k][m][l] = MAX_POWER_INDEX;
	}
	
	//DBG_871X("<===== PHY_InitTxPowerLimit()!\n" );
}

void
PHY_SetTxPowerLimit(
	IN	PADAPTER		Adapter,
	IN	u8				*Regulation,
	IN	u8				*Band,
	IN	u8				*Bandwidth,
	IN	u8				*RateSection,
	IN	u8				*RfPath,
	IN	u8				*Channel,
	IN	u8				*PowerLimit
	)
{
	HAL_DATA_TYPE		*pHalData = GET_HAL_DATA( Adapter );
	u8				regulation=0, bandwidth=0, rateSection=0, 
					channel;
	s8 				powerLimit = 0, prevPowerLimit, channelIndex;

	//DBG_871X( "Index of power limit table [band %s][regulation %s][bw %s][rate section %s][rf path %s][chnl %s][val %s]\n", 
	//	  Band, Regulation, Bandwidth, RateSection, RfPath, Channel, PowerLimit );

	if ( !GetU1ByteIntegerFromStringInDecimal( (s8 *)Channel, &channel ) ||
		 !GetU1ByteIntegerFromStringInDecimal( (s8 *)PowerLimit, &powerLimit ) )
	{
		DBG_871X("Illegal index of power limit table [chnl %s][val %s]\n", Channel, PowerLimit );
	}

	powerLimit = powerLimit > MAX_POWER_INDEX ? MAX_POWER_INDEX : powerLimit;

	if ( eqNByte( Regulation, (u8 *)("FCC"), 3 ) ) regulation = 0;
	else if ( eqNByte( Regulation, (u8 *)("MKK"), 3 ) ) regulation = 1;
	else if ( eqNByte( Regulation, (u8 *)("ETSI"), 4 ) ) regulation = 2;
	else if ( eqNByte( Regulation, (u8 *)("WW13"), 4 ) ) regulation = 3;

	if ( eqNByte( RateSection, (u8 *)("CCK"), 3 ) && eqNByte( RfPath, (u8 *)("1T"), 2 ) )
		rateSection = 0;
	else if ( eqNByte( RateSection, (u8 *)("OFDM"), 4 ) && eqNByte( RfPath, (u8 *)("1T"), 2 ) )
		rateSection = 1;
	else if ( eqNByte( RateSection, (u8 *)("HT"), 2 ) && eqNByte( RfPath, (u8 *)("1T"), 2 ) )
		rateSection = 2;
	else if ( eqNByte( RateSection, (u8 *)("HT"), 2 ) && eqNByte( RfPath, (u8 *)("2T"), 2 ) )
		rateSection = 3;
	else if ( eqNByte( RateSection, (u8 *)("HT"), 2 ) && eqNByte( RfPath, (u8 *)("3T"), 2 ) )
		rateSection = 4;
	else if ( eqNByte( RateSection, (u8 *)("HT"), 2 ) && eqNByte( RfPath, (u8 *)("4T"), 2 ) )
		rateSection = 5;
	else if ( eqNByte( RateSection, (u8 *)("VHT"), 3 ) && eqNByte( RfPath, (u8 *)("1T"), 2 ) )
		rateSection = 6;
	else if ( eqNByte( RateSection, (u8 *)("VHT"), 3 ) && eqNByte( RfPath, (u8 *)("2T"), 2 ) )
		rateSection = 7;
	else if ( eqNByte( RateSection, (u8 *)("VHT"), 3 ) && eqNByte( RfPath, (u8 *)("3T"), 2 ) )
		rateSection = 8;
	else if ( eqNByte( RateSection, (u8 *)("VHT"), 3 ) && eqNByte( RfPath, (u8 *)("4T"), 2 ) )
		rateSection = 9;
	else
	{
		DBG_871X("Wrong rate section!\n");
		return;
	}
			

	if ( eqNByte( Bandwidth, (u8 *)("20M"), 3 ) ) bandwidth = 0;
	else if ( eqNByte( Bandwidth, (u8 *)("40M"), 3 ) ) bandwidth = 1;
	else if ( eqNByte( Bandwidth, (u8 *)("80M"), 3 ) ) bandwidth = 2;
	else if ( eqNByte( Bandwidth, (u8 *)("160M"), 4 ) ) bandwidth = 3;

	if ( eqNByte( Band, (u8 *)("2.4G"), 4 ) )
	{
		channelIndex = phy_GetChannelIndexOfTxPowerLimit( BAND_ON_2_4G, channel );

		if ( channelIndex == -1 )
			return;

		prevPowerLimit = pHalData->TxPwrLimit_2_4G[regulation][bandwidth][rateSection][channelIndex][ODM_RF_PATH_A];

		if ( powerLimit < prevPowerLimit )
			pHalData->TxPwrLimit_2_4G[regulation][bandwidth][rateSection][channelIndex][ODM_RF_PATH_A] = powerLimit;
		
		//DBG_871X( "2.4G Band value : [regulation %d][bw %d][rate_section %d][chnl %d][val %d]\n", 
		//	  regulation, bandwidth, rateSection, channelIndex, pHalData->TxPwrLimit_2_4G[regulation][bandwidth][rateSection][channelIndex][ODM_RF_PATH_A] );
	}
	else if ( eqNByte( Band, (u8 *)("5G"), 2 ) )
	{
		channelIndex = phy_GetChannelIndexOfTxPowerLimit( BAND_ON_5G, channel );

		if ( channelIndex == -1 )
			return;

		prevPowerLimit = pHalData->TxPwrLimit_5G[regulation][bandwidth][rateSection][channelIndex][ODM_RF_PATH_A];

		if ( powerLimit < prevPowerLimit )
			pHalData->TxPwrLimit_5G[regulation][bandwidth][rateSection][channelIndex][ODM_RF_PATH_A] = powerLimit;

		//DBG_871X( "5G Band value : [regulation %d][bw %d][rate_section %d][chnl %d][val %d]\n", 
		//	  regulation, bandwidth, rateSection, channel, pHalData->TxPwrLimit_5G[regulation][bandwidth][rateSection][channelIndex][ODM_RF_PATH_A] );
	}
	else
	{
		DBG_871X("Cannot recognize the band info in %s\n", Band );
		return;
	}
}

u8
PHY_GetTxPowerIndex(
	IN	PADAPTER			pAdapter,
	IN	u8					RFPath,
	IN	u8					Rate,	
	IN	CHANNEL_WIDTH		BandWidth,	
	IN	u8					Channel
	)
{
	u8	txPower = 0x3E;

	txPower = PHY_GetTxPowerIndex_8723B(pAdapter, RFPath, Rate, BandWidth, Channel);

	return txPower;
}

void
PHY_SetTxPowerIndex(
	IN	PADAPTER		pAdapter,
	IN	u32				PowerIndex,
	IN	u8				RFPath,	
	IN	u8				Rate
	)
{
	PHY_SetTxPowerIndex_8723B( pAdapter, PowerIndex, RFPath, Rate );
}

void
Hal_ChannelPlanToRegulation(
	IN	PADAPTER		Adapter,
	IN	u16				ChannelPlan
	)
{
	HAL_DATA_TYPE		*pHalData = GET_HAL_DATA(Adapter);
	pHalData->Regulation2_4G = TXPWR_LMT_WW;
	pHalData->Regulation5G = TXPWR_LMT_WW;

	switch(ChannelPlan)
	{	
		case RT_CHANNEL_DOMAIN_WORLD_NULL:
			pHalData->Regulation2_4G = TXPWR_LMT_WW;	
			break;
		case RT_CHANNEL_DOMAIN_ETSI1_NULL:
			pHalData->Regulation2_4G = TXPWR_LMT_ETSI;
			break;
		case RT_CHANNEL_DOMAIN_FCC1_NULL:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_MKK1_NULL:
			pHalData->Regulation2_4G = TXPWR_LMT_MKK;
			break;
		case RT_CHANNEL_DOMAIN_ETSI2_NULL:
			pHalData->Regulation2_4G = TXPWR_LMT_ETSI;
			break;
		case RT_CHANNEL_DOMAIN_FCC1_FCC1:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_ETSI1:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_ETSI;
			break;
		case RT_CHANNEL_DOMAIN_MKK1_MKK1:
			pHalData->Regulation2_4G = TXPWR_LMT_MKK;
			pHalData->Regulation5G = TXPWR_LMT_MKK;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_KCC1:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_MKK;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_FCC2:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
					break;
		case RT_CHANNEL_DOMAIN_WORLD_FCC3:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_FCC4:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_FCC5:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_FCC6:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_FCC1_FCC7:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_ETSI2:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_ETSI3:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_MKK1_MKK2:
			pHalData->Regulation2_4G = TXPWR_LMT_MKK;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_MKK1_MKK3:
			pHalData->Regulation2_4G = TXPWR_LMT_MKK;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_FCC1_NCC1:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_FCC1_NCC2:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_GLOBAL_NULL:
			pHalData->Regulation2_4G = TXPWR_LMT_WW;
			pHalData->Regulation5G = TXPWR_LMT_WW;
			break;
		case RT_CHANNEL_DOMAIN_ETSI1_ETSI4:
			pHalData->Regulation2_4G = TXPWR_LMT_ETSI;
			pHalData->Regulation5G = TXPWR_LMT_ETSI;
			break;
		case RT_CHANNEL_DOMAIN_FCC1_FCC2:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_FCC1_NCC3:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_ETSI5:
			pHalData->Regulation2_4G = TXPWR_LMT_ETSI;
			pHalData->Regulation5G = TXPWR_LMT_ETSI;
			break;
		case RT_CHANNEL_DOMAIN_FCC1_FCC8:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_ETSI6:
			pHalData->Regulation2_4G = TXPWR_LMT_ETSI;
			pHalData->Regulation5G = TXPWR_LMT_ETSI;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_ETSI7:
			pHalData->Regulation2_4G = TXPWR_LMT_ETSI;
			pHalData->Regulation5G = TXPWR_LMT_ETSI;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_ETSI8:
			pHalData->Regulation2_4G = TXPWR_LMT_ETSI;
			pHalData->Regulation5G = TXPWR_LMT_ETSI;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_ETSI9:
			pHalData->Regulation2_4G = TXPWR_LMT_ETSI;
			pHalData->Regulation5G = TXPWR_LMT_ETSI;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_ETSI10:
			pHalData->Regulation2_4G = TXPWR_LMT_ETSI;
			pHalData->Regulation5G = TXPWR_LMT_ETSI;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_ETSI11:
			pHalData->Regulation2_4G = TXPWR_LMT_ETSI;
			pHalData->Regulation5G = TXPWR_LMT_ETSI;
			break;
		case RT_CHANNEL_DOMAIN_FCC1_NCC4:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_ETSI12:
			pHalData->Regulation2_4G = TXPWR_LMT_ETSI;
			pHalData->Regulation5G = TXPWR_LMT_ETSI;
			break;
		case RT_CHANNEL_DOMAIN_FCC1_FCC9:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_WORLD_ETSI13:
			pHalData->Regulation2_4G = TXPWR_LMT_ETSI;
			pHalData->Regulation5G = TXPWR_LMT_ETSI;
			break;
		case RT_CHANNEL_DOMAIN_FCC1_FCC10:
			pHalData->Regulation2_4G = TXPWR_LMT_FCC;
			pHalData->Regulation5G = TXPWR_LMT_FCC;
			break;
		case RT_CHANNEL_DOMAIN_REALTEK_DEFINE: //Realtek Reserve
			pHalData->Regulation2_4G = TXPWR_LMT_WW;
			pHalData->Regulation5G = TXPWR_LMT_WW;
			break;
		default:
			break;
	}
}

